Revit 2027 API
AssetSet.Insert Method
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Asset item
)
Public Overridable Function Insert (
	item As Asset
) As Boolean
public:
virtual bool Insert(
	Asset^ item
)
abstract Insert :
        item : Asset -> bool
override Insert :
        item : Asset -> bool
Parameters
item Asset
Return Value
Boolean
See Also
Reference
AssetSet Class
Autodesk.Revit.DB.Visual Namespace